{
  "nigerianDishes": [
    {
      "id": "jollof-rice",
      "name": "Jollof Rice",
      "category": "nigerian",
      "subcategory": "rice",
      "description": "A flavorful West African rice dish cooked with tomatoes, peppers, and aromatic spices. It's made with long-grain rice, tomatoes, onions, peppers, and various spices. The dish is often served at parties and special occasions.",
      "origin": "Nigeria (West Africa)",
      "ingredients": [
        "Long grain rice",
        "Tomatoes and tomato paste",
        "Red bell peppers",
        "Scotch bonnet peppers",
        "Onions",
        "Vegetable oil",
        "Curry powder, thyme, bay leaves",
        "Chicken or vegetable stock"
      ],
      "platingTechniques": [
        {
          "id": "classic-elevation",
          "name": "Classic Elevation",
          "description": "This technique creates height by molding the jollof rice into a cylindrical shape, topped with protein, and surrounded by complementary elements.",
          "steps": [
            "Use a ring mold to create a cylindrical shape with the jollof rice in the center of the plate.",
            "Carefully remove the mold, ensuring the rice maintains its shape.",
            "Place a piece of grilled chicken or protein on top of the rice.",
            "Arrange fried plantains in a fan pattern on one side of the plate.",
            "Add a small amount of sauce around the base of the rice for color contrast.",
            "Garnish with micro greens or herb sprigs for freshness and height."
          ],
          "tips": [
            "Ensure rice is slightly sticky to hold its shape",
            "Use a warm plate to keep food hot longer",
            "Consider color contrast between rice, protein, and garnish"
          ],
          "imageSrc": "https://i.pinimg.com/736x/99/c3/8d/99c38d66192d74f6c7a71615df72be16.jpg",
          "techniqueType": "landscape"
        },
        {
          "id": "deconstructed",
          "name": "Deconstructed",
          "description": "This modern approach separates the components of the dish, allowing each element to shine while creating a visually striking presentation.",
          "steps": [
            "Create a swoosh of tomato sauce on one side of the plate.",
            "Place a small mound of jollof rice on the opposite side.",
            "Arrange sliced grilled chicken or protein in the center.",
            "Add crispy fried plantain chips vertically for height and texture.",
            "Dot the plate with herb oil for color contrast.",
            "Finish with micro herbs and edible flowers for elegance."
          ],
          "tips": [
            "Use the back of a spoon to create smooth sauce swooshes",
            "Maintain clean edges around each component",
            "Consider the plate as a canvas with intentional negative space"
          ],
          "imageSrc": "https://i.pinimg.com/736x/54/35/c9/5435c9f6b3bc1624fa932a9e3bb4a8de.jpg",
          "techniqueType": "freeform"
        },
        {
          "id": "modern-minimalist",
          "name": "Modern Minimalist",
          "description": "This technique focuses on clean lines, negative space, and precise placement for an elegant, contemporary presentation.",
          "steps": [
            "Use a rectangular plate with ample negative space.",
            "Place a quenelle of jollof rice off-center on the plate.",
            "Position a small piece of perfectly cooked protein beside the rice.",
            "Add three small dots of pepper sauce in a line for visual rhythm.",
            "Place a single thin plantain chip for height and texture.",
            "Finish with a single herb leaf for a touch of green."
          ],
          "tips": [
            "Less is more - focus on quality over quantity",
            "Perfect each element's execution",
            "Use precise, intentional placement"
          ],
          "imageSrc": "https://i.pinimg.com/736x/c0/12/48/c01248a0c0e294c6a8899479d93ed7a2.jpg",
          "techniqueType": "nordic"
        }
      ],
      "relatedDishes": ["fried-rice", "coconut-rice", "ofada-rice"],
      "imageSrc": "https://i.pinimg.com/736x/41/a0/66/41a066b8175488f49eb8544b74a2b603.jpg"
    },
    
    {
      "id": "egusi-soup",
      "name": "Egusi Soup",
      "category": "nigerian",
      "subcategory": "soup",
      "description": "A rich, thick soup made with ground melon seeds, vegetables, and protein. It's typically eaten with fufu, pounded yam, or other starchy sides.",
      "origin": "Nigeria (West Africa)",
      "ingredients": [
        "Ground egusi (melon) seeds",
        "Palm oil",
        "Leafy greens (spinach, bitter leaf, or pumpkin leaves)",
        "Tomatoes",
        "Peppers",
        "Onions",
        "Stock fish",
        "Meat or fish",
        "Seasonings and spices"
      ],
      "platingTechniques": [
        {
          "id": "bathing-technique",
          "name": "Bathing Technique",
          "description": "This technique presents protein partially submerged in the rich egusi soup, creating a luxurious and appetizing presentation.",
          "steps": [
            "Select a wide, shallow bowl with enough depth for the soup.",
            "Pour a base layer of egusi soup into the bowl.",
            "Place a piece of protein (fish, meat, or seafood) partially submerged in the center.",
            "Arrange additional protein and vegetables artistically around the main piece.",
            "Add small pools of palm oil for color contrast.",
            "Garnish with fresh herbs and a sprinkle of ground crayfish."
          ],
          "tips": [
            "Ensure soup has the right consistency - not too thick or thin",
            "Create contrast between the yellow egusi and green vegetables",
            "Consider temperature when serving - the bowl should be warm"
          ],
          "imageSrc": "https://i.pinimg.com/736x/43/cf/bd/43cfbd9968915b26e9aa38964f390d1f.jpg",
          "techniqueType": "bathing"
        },
        {
          "id": "organic-materials",
          "name": "Organic Materials Presentation",
          "description": "Serving egusi soup in a carved calabash or wooden bowl adds authenticity and a rustic, traditional feel to the presentation.",
          "steps": [
            "Select an appropriately sized calabash or wooden bowl.",
            "Ensure the serving vessel is properly cleaned and treated.",
            "Pour the egusi soup into the calabash.",
            "Arrange protein pieces to create height in the center.",
            "Garnish with fresh herbs and ground spices.",
            "Serve with the starchy side (pounded yam, fufu) in a separate smaller calabash."
          ],
          "tips": [
            "The natural texture of the calabash adds visual interest",
            "Consider the size relationship between soup and side dish vessels",
            "Add a small wooden or horn spoon for authenticity"
          ],
          "imageSrc": "https://i.pinimg.com/736x/d7/88/c7/d788c74d2e9f6455d4be13e4017f83ef.jpg",
          "techniqueType": "organic"
        }
      ],
      "relatedDishes": ["okra-soup", "ogbono-soup", "efo-riro"],
      "imageSrc": "https://i.pinimg.com/736x/2f/40/1e/2f401e41f3cb51929d8c6fdcaa1f007c.jpg"
    },
    
    {
      "id": "suya",
      "name": "Suya",
      "category": "nigerian",
      "subcategory": "grilled",
      "description": "Spicy skewered meat, typically beef, coated with a peanut-based spice mix called yaji. It's a popular street food throughout Nigeria and West Africa.",
      "origin": "Northern Nigeria",
      "ingredients": [
        "Beef (sirloin or ribeye)",
        "Yaji spice mix (ground peanuts, chili pepper, ginger, garlic)",
        "Vegetable oil",
        "Onions",
        "Tomatoes",
        "Fresh chili peppers"
      ],
      "platingTechniques": [
        {
          "id": "landscape-arrangement",
          "name": "Landscape Arrangement",
          "description": "This technique arranges suya skewers in a linear, horizontal presentation that showcases the meat's charred exterior and juicy interior.",
          "steps": [
            "Select a rectangular or oval plate with ample space.",
            "Arrange 3-4 suya skewers parallel to each other in a horizontal line.",
            "Place sliced onions, tomatoes, and fresh chilies at one end of the plate.",
            "Add a small bowl of extra yaji spice mix at the opposite end.",
            "Drizzle with a small amount of oil or herb-infused oil.",
            "Garnish with fresh herbs and a wedge of lime or lemon."
          ],
          "tips": [
            "Ensure skewers are uniform in size for visual harmony",
            "Create color contrast with the garnishes",
            "Consider removing skewers before serving for easier eating"
          ],
          "imageSrc": "https://i.pinimg.com/736x/44/8b/00/448b00e3931fc194d4f244d0f7813ef6.jpg",
          "techniqueType": "landscape"
        },
        {
          "id": "freeform-arrangement",
          "name": "Free-form Arrangement",
          "description": "This artistic approach creates a more casual, dynamic presentation of suya with intentionally placed elements that appear spontaneous.",
          "steps": [
            "Select a large round plate with ample negative space.",
            "Remove meat from skewers and arrange in an organic pile in the center.",
            "Create swooshes of sauce or oil around the meat.",
            "Scatter sliced onions, tomatoes, and chilies around the plate.",
            "Add small piles of yaji spice in strategic locations.",
            "Finish with micro herbs and edible flowers for color contrast."
          ],
          "tips": [
            "Though it appears random, each element should be intentionally placed",
            "Use the rule of thirds for visual balance",
            "Consider height variation for visual interest"
          ],
          "imageSrc": "https://i.pinimg.com/736x/e0/d9/6b/e0d96b0cfc9e27645b84d84eb4433167.jpg",
          "techniqueType": "freeform"
        }
      ],
      "relatedDishes": ["asun", "kilishi", "tsire"],
      "imageSrc": "https://i.pinimg.com/736x/7f/2c/f5/7f2cf53b8e61ab5188c2b3d2991c77d5.jpg"
    }
    ,
    {
      "id": "pounded-yam-efo-riro",
      "name": "Pounded Yam and Efo Riro",
      "category": "nigerian",
      "subcategory": "soup",
      "description": "Smooth, elastic pounded yam served with efo riro, a rich spinach stew with assorted meats and seafood. This combination is a staple in Yoruba cuisine.",
      "origin": "Western Nigeria (Yoruba)",
      "ingredients": [
        "Yam tubers",
        "Spinach or pumpkin leaves",
        "Palm oil",
        "Assorted meats and fish",
        "Crayfish",
        "Peppers",
        "Onions",
        "Locust beans (iru)",
        "Seasonings and spices"
      ],
      "platingTechniques": [
        {
          "id": "super-bowl",
          "name": "Super Bowl Technique",
          "description": "This technique layers pounded yam and efo riro in a bowl, creating a visually appealing presentation that reveals different components as you eat.",
          "steps": [
            "Select a wide, shallow bowl with enough depth for both components.",
            "Place a portion of pounded yam on one side of the bowl.",
            "Pour efo riro on the other side, allowing it to slightly touch the yam.",
            "Arrange pieces of meat and fish to create height on top of the stew.",
            "Add a small pool of palm oil for color contrast.",
            "Garnish with fresh herbs and a sprinkle of ground crayfish."
          ],
          "tips": [
            "Ensure pounded yam has a smooth, elastic texture",
            "Create a clear boundary between yam and stew",
            "Consider the bowl color to enhance visual appeal"
          ],
          "imageSrc": "https://i.pinimg.com/736x/32/9f/bf/329fbf29cc69fe604e7b5a5ec2cf2f3d.jpg",
          "techniqueType": "superbowl"
        },
        {
          "id": "hide-and-seek",
          "name": "Hide and Seek Technique",
          "description": "This playful technique conceals the rich efo riro beneath a thin layer of pounded yam, creating a surprise element when the diner breaks through.",
          "steps": [
            "Select a wide, shallow bowl or plate with a slight depression.",
            "Pour a base layer of efo riro into the center of the plate.",
            "Place a thin, flat disc of pounded yam on top, covering most of the stew.",
            "Leave a small portion of the stew visible around the edges.",
            "Create a small opening or crack in the center of the yam to hint at what's beneath.",
            "Garnish with fresh herbs and a drizzle of palm oil."
          ],
          "tips": [
            "Ensure the pounded yam layer is thin enough to cut through easily",
            "The visible rim of stew creates anticipation",
            "Consider adding a small piece of meat or fish as a visual cue"
          ],
          "imageSrc": "https://i.pinimg.com/736x/4d/96/1d/4d961db84f2ed9879c9a8d024d4d3e9c.jpg",
          "techniqueType": "hideandseek"
        }
      ],
      "relatedDishes": ["amala-ewedu", "eba-egusi", "fufu-okra-soup"],
      "imageSrc": "https://i.pinimg.com/736x/27/0d/f6/270df610d41a5be10bb81077c4d38a90.jpg"
    },
    
    {
      "id": "moin-moin",
      "name": "Moin Moin",
      "category": "nigerian",
      "subcategory": "steamed",
      "description": "A steamed bean pudding made from peeled and blended black-eyed peas, peppers, onions, and spices. It can be plain or filled with eggs, fish, or meat.",
      "origin": "Nigeria (West Africa)",
      "ingredients": [
        "Black-eyed peas",
        "Red bell peppers",
        "Scotch bonnet peppers",
        "Onions",
        "Vegetable oil",
        "Seasonings",
        "Optional fillings (boiled eggs, fish, meat)"
      ],
      "platingTechniques": [
        {
          "id": "nordic-look",
          "name": "Nordic Look",
          "description": "This minimalist technique presents moin moin with clean lines, natural elements, and a focus on the dish's natural beauty.",
          "steps": [
            "Select a simple, preferably white plate with clean lines.",
            "Unmold the moin moin and slice it into a perfect rectangle or triangle.",
            "Place the moin moin off-center on the plate.",
            "Add a small amount of sauce or oil in a precise line or dot pattern.",
            "Place a single slice of boiled egg or piece of fish for contrast.",
            "Finish with a few herb leaves or edible flowers for color."
          ],
          "tips": [
            "Focus on perfect execution and clean cuts",
            "Use negative space intentionally",
            "Consider the geometric relationship between elements"
          ],
          "imageSrc": "https://i.pinimg.com/736x/6e/d6/99/6ed69939cd0762f67940352cc13c1247.jpg",
          "techniqueType": "nordic"
        },
        {
          "id": "futuristic",
          "name": "Futuristic Technique",
          "description": "This contemporary approach presents moin moin in unexpected shapes and forms, using modern tools and techniques for a cutting-edge presentation.",
          "steps": [
            "Use a ring mold or specialized mold to create a perfect cylindrical or geometric shape.",
            "Place the molded moin moin in the center of a dark plate for contrast.",
            "Create a sauce or puree with vibrant color and pipe it in a precise pattern.",
            "Add elements of molecular gastronomy, such as foam or spheres.",
            "Incorporate unexpected textures, like crispy elements or powder.",
            "Use tweezers to place micro herbs or edible flowers with precision."
          ],
          "tips": [
            "Focus on precision and unexpected elements",
            "Consider using modern serving vessels like slate or glass",
            "Create contrast between traditional food and modern presentation"
          ],
          "imageSrc": "https://i.pinimg.com/736x/94/e0/f2/94e0f2489e2a6354d8ac8b12fd1b95cb.jpg",
          "techniqueType": "futuristic"
        }
      ],
      "relatedDishes": ["akara", "gbegiri", "ekuru"],
      "imageSrc": "https://i.pinimg.com/736x/b7/0d/84/b70d84d5a68d3b16401c79c798f03a4f.jpg"
    },
    
    {
      "id": "afang-soup",
      "name": "Afang Soup",
      "category": "nigerian",
      "subcategory": "soup",
      "description": "A rich and savory Nigerian soup made from Afang (Okazi) leaves and waterleaf, typically flavored with assorted meats, fish, and periwinkles.",
      "origin": "Efik and Ibibio people of Southern Nigeria",
      "ingredients": [
        "Afang (Okazi) leaves",
        "Waterleaf",
        "Palm oil",
        "Assorted beef and goat meat",
        "Smoked fish",
        "Stockfish",
        "Periwinkles (optional)",
        "Crayfish",
        "Onions",
        "Peppers (Scotch bonnet)",
        "Seasoning cubes"
      ],
      "platingTechniques": [
        {
          "id": "afang-traditional-bowl",
          "name": "Traditional Earthenware Presentation",
          "description": "Serving Afang soup in a traditional earthenware or clay pot enhances its authenticity and visual appeal, often accompanied by a neatly wrapped swallow.",
          "steps": [
            "Ladle a generous portion of Afang soup into a clean earthenware bowl.",
            "Ensure chunks of meat and fish are visible.",
            "Place a neatly molded portion of fufu, eba, or pounded yam beside the soup or in a separate, smaller traditional bowl.",
            "Garnish the soup with a sprinkle of ground crayfish or a fresh pepper.",
            "A small amount of palm oil can be drizzled on top for sheen."
          ],
          "tips": [
            "Warm the earthenware bowl before serving to keep the soup hot.",
            "The contrast between the dark green soup and the white/yellow swallow is visually appealing.",
            "Ensure the swallow is smooth and well-formed."
          ],
          "imageSrc": "https://i.pinimg.com/736x/f1/52/b6/f152b610b6e09a5caa40168c17e38c3b.jpg",
          "techniqueType": "traditional"
        },
        {
          "id": "afang-modern-swirl",
          "name": "Modern Green Swirl",
          "description": "A contemporary take, presenting the soup with a focus on its vibrant green color, often with a swirl or artistic placement of the swallow.",
          "steps": [
            "Use a wide, shallow white bowl for contrast.",
            "Pour the Afang soup, ensuring it's not too watery.",
            "Create a small well in the center and place a quenelle or small, elegantly shaped mound of swallow.",
            "Alternatively, place the swallow to the side and create a gentle swirl in the soup with the back of a spoon before adding protein.",
            "Artistically arrange meat and fish pieces.",
            "Garnish with microgreens or a thinly sliced red chili for color pop."
          ],
          "tips": [
            "The consistency of the soup is key for this presentation.",
            "Use high-quality, brightly colored ingredients.",
            "Less is more; avoid overcrowding the plate."
          ],
          "imageSrc": "https://i.pinimg.com/736x/3b/f6/79/3bf679edb7d7ae98b9b9db8cb176c841.jpg",
          "techniqueType": "modern"
        }
      ],
      "relatedDishes": ["edikang-ikong-soup", "efo-riro", "egusi-soup"],
      "imageSrc": "https://i.pinimg.com/736x/3b/38/ce/3b38cec8042db05b59f56bc17598a8e2.jpg"
    }
    ,
    {
      "id": "banga-soup",
      "name": "Banga Soup (Ofe Akwu)",
      "category": "nigerian",
      "subcategory": "soup",
      "description": "A flavorful soup made from palm fruit extract, native spices, and a variety of meats and fish. It's popular in the Niger Delta region and among Igbo people.",
      "origin": "Niger Delta and Eastern Nigeria",
      "ingredients": ["Palm fruit (banga)", "Beef or assorted meat", "Fresh or smoked fish", "Banga spice mix (tyko, oburunbebe, etc.)", "Beletete (dried banga leaves)", "Onions", "Ground crayfish", "Chili pepper", "Salt"],
      "platingTechniques": [
        {
          "id": "banga-rustic-charm",
          "name": "Rustic Charm Presentation",
          "description": "Serving Banga soup in a traditional clay pot or deep bowl, emphasizing its rich color and texture, often with starch served alongside.",
          "steps": ["Ladle the Banga soup into a rustic clay pot or a deep, dark-colored bowl.", "Ensure pieces of meat and fish are prominent.", "Garnish with fresh scent leaves or a sprinkle of dried pepper.", "Serve with starch (usi/starch, eba, or pounded yam) on the side, perhaps in a complementary smaller bowl.", "A drizzle of fresh palm oil can enhance the visual appeal."],
          "tips": ["The deep orange-red color of the soup should be the star.", "Contrast the soup with a light-colored starch.", "Authentic serving ware adds to the experience."],
          "imageSrc": "https://i.pinimg.com/736x/7d/7c/f1/7d7cf1e5471aa4b23d9dc4b251de5d15.jpg",
          "techniqueType": "traditional"
        },
        {
          "id": "banga-island-style",
          "name": "Island Style Centerpiece",
          "description": "A modern presentation where the soup is served in a wide bowl with the starch and protein arranged artfully as a centerpiece.",
          "steps": ["Use a wide, shallow bowl.", "Pour a generous amount of Banga soup as the base.", "Place a neatly molded portion of starch (e.g., a small dome of usi) slightly off-center.", "Arrange choice pieces of fish and meat around the starch, partially submerged in the soup.", "Garnish with a sprig of fresh herbs or thinly sliced peppers.", "Ensure the vibrant color of the soup is visible."],
          "tips": ["Focus on a clean presentation with distinct elements.", "The arrangement should look inviting and balanced.", "Use contrasting colors for garnishes if possible."],
          "imageSrc": "https://i.pinimg.com/736x/dc/b4/69/dcb4699e594e3f2bfc939fa80cf19d61.jpg",
          "techniqueType": "modern"
        }
      ],
      "relatedDishes": ["ofe-nsala", "ogbono-soup", "black-soup"],
      "imageSrc": "https://i.pinimg.com/736x/6a/fb/9d/6afb9d9e8b73571bcb5a2548b03e9b24.jpg"
    },
    {
      "id": "ogbono-soup",
      "name": "Ogbono Soup",
      "category": "nigerian",
      "subcategory": "soup",
      "description": "A draw soup made from ground ogbono (wild mango) seeds, known for its mucilaginous texture. It's typically cooked with palm oil, vegetables, and assorted proteins.",
      "origin": "Southern and Eastern Nigeria",
      "ingredients": ["Ground ogbono seeds", "Palm oil", "Leafy vegetables (uziza, spinach, or bitter leaf)", "Assorted meat (beef, goat, shaki)", "Smoked fish or stockfish", "Crayfish", "Onions", "Peppers", "Seasoning cubes"],
      "platingTechniques": [
        {
          "id": "ogbono-classic-draw",
          "name": "Classic Draw Presentation",
          "description": "Highlighting the characteristic draw of Ogbono soup, served traditionally with a swallow.",
          "steps": ["Serve the Ogbono soup in a traditional soup bowl.", "Ensure the soup has a good consistency, showcasing its 'draw'.", "Place large, appealing pieces of meat and fish within the soup.", "Accompany with a neatly wrapped portion of fufu, eba, or pounded yam.", "A swirl of palm oil on top can add to the visual appeal."],
          "tips": ["The 'draw' is a key feature, so ensure the soup is not too thick or watery.", "Warm bowls help maintain temperature.", "The contrast of the dark soup with a light-colored swallow is classic."],
          "imageSrc": "https://placehold.co/400x300/EEEEEE/000000?text=Classic+Ogbono",
          "techniqueType": "traditional"
        },
        {
          "id": "ogbono-layered-reveal",
          "name": "Layered Reveal in Glass",
          "description": "A modern approach using a clear glass bowl to showcase the layers and textures within the Ogbono soup.",
          "steps": ["Select a clear, heat-resistant glass bowl.", "Carefully ladle the Ogbono soup into the bowl.", "Strategically place pieces of meat, fish, and visible greens so they are visible through the glass.", "Garnish the top with a fresh herb or a contrasting sprinkle of crayfish.", "Serve with a small, elegant portion of swallow on a side plate."],
          "tips": ["This technique works best if the soup has distinct elements like whole periwinkles or chunks of fish.", "Ensure the glass is impeccably clean.", "The visual appeal comes from seeing the ingredients suspended in the soup."],
          "imageSrc": "https://placehold.co/400x300/EEEEEE/000000?text=Layered+Ogbono",
          "techniqueType": "modern"
        }
      ],
      "relatedDishes": ["okro-soup", "ewedu-soup", "nsala-soup"],
      "imageSrc": "https://placehold.co/600x400/CCCCCC/000000?text=Ogbono+Soup"
    },
    {
      "id": "nsala-soup",
      "name": "Nsala Soup (White Soup)",
      "category": "nigerian",
      "subcategory": "soup",
      "description": "A light, peppery soup made without palm oil, typically thickened with yam or cocoyam. It's often cooked with catfish and aromatic spices.",
      "origin": "Eastern Nigeria (Igbo)",
      "ingredients": ["Catfish or other fresh fish", "Yam or cocoyam (for thickening)", "Uziza leaves and seeds", "Utazi leaves", "Ehuru (calabash nutmeg)", "Uda", "Scotch bonnet peppers", "Onions", "Crayfish", "Seasoning cubes"],
      "platingTechniques": [
        {
          "id": "nsala-clear-broth",
          "name": "Clear Broth Elegance",
          "description": "Presenting Nsala soup to highlight its light color and the freshness of the ingredients, especially the fish.",
          "steps": ["Serve in a white or light-colored soup bowl to emphasize the 'white' nature of the soup.", "Place a whole piece of catfish or large chunks attractively in the center.", "Ensure the broth is clear and inviting, with visible spices and herbs.", "Garnish with fresh uziza or utazi leaves.", "Serve with pounded yam on the side."],
          "tips": ["The clarity of the soup is important.", "Freshness of ingredients is key to the visual and taste appeal.", "Avoid overcrowding the bowl."],
          "imageSrc": "https://placehold.co/400x300/EEEEEE/000000?text=Clear+Nsala",
          "techniqueType": "elegant"
        },
        {
          "id": "nsala-family-style-pot",
          "name": "Family-Style Pot Presentation",
          "description": "Serving Nsala soup in a traditional cooking pot or a rustic serving dish, emphasizing a communal and hearty feel.",
          "steps": ["Serve directly from a clean, attractive cooking pot (e.g., clay or cast iron) or transfer to a large, rustic serving bowl.", "Ensure generous portions of fish are visible.", "Scatter fresh herbs over the top.", "Provide individual bowls and a large portion of pounded yam for sharing."],
          "tips": ["This style is great for gatherings.", "The aroma from the pot adds to the experience.", "Ensure the serving pot is presentable."],
          "imageSrc": "https://placehold.co/400x300/EEEEEE/000000?text=Family+Style+Nsala",
          "techniqueType": "communal"
        }
      ],
      "relatedDishes": ["pepper-soup", "ukodo", "banga-soup"],
      "imageSrc": "https://placehold.co/600x400/CCCCCC/000000?text=Nsala+Soup"
    },
    {
      "id": "edikang-ikong-soup",
      "name": "Edikang Ikong Soup",
      "category": "nigerian",
      "subcategory": "soup",
      "description": "A nutritious and savory vegetable soup from the Efik and Ibibio people, made primarily with pumpkin leaves (ugwu) and waterleaf, along with assorted meats and fish.",
      "origin": "Cross River and Akwa Ibom States (Southern Nigeria)",
      "ingredients": ["Pumpkin leaves (ugwu)", "Waterleaf (gbure)", "Palm oil", "Assorted meat (beef, goat, shaki)", "Smoked fish", "Stockfish", "Periwinkles", "Crayfish", "Onions", "Peppers", "Seasoning cubes"],
      "platingTechniques": [
        {
          "id": "edikang-vibrant-green",
          "name": "Vibrant Green Mound",
          "description": "Showcasing the rich green color of the Edikang Ikong, often served with a contrasting swallow.",
          "steps": ["Ladle a generous portion of the soup into a wide bowl.", "Mound the soup slightly in the center to give it height.", "Ensure pieces of meat, fish, and periwinkles are visible throughout.", "Serve with a neatly shaped portion of fufu, eba, or pounded yam beside it.", "A light drizzle of palm oil can enhance the sheen."],
          "tips": ["The vibrant green of the vegetables should be preserved during cooking.", "Use a white or light-colored bowl for maximum color contrast.", "Don't overcook the vegetables."],
          "imageSrc": "https://placehold.co/400x300/EEEEEE/000000?text=Vibrant+Edikang+Ikong",
          "techniqueType": "mound"
        },
        {
          "id": "edikang-deconstructed-elements",
          "name": "Deconstructed Vegetable Medley",
          "description": "A modern take where the soup's components are artfully arranged to highlight individual textures and colors.",
          "steps": ["Use a large, flat plate.", "Place a neat base of the Edikang Ikong soup.", "Artistically arrange larger pieces of protein (e.g., grilled fish, large prawns) on top or beside the soup.", "Garnish with fresh, contrasting microgreens or edible flowers.", "A small, elegant quenelle of swallow can be placed on the side."],
          "tips": ["Focus on clean lines and intentional placement.", "Each element should be perfectly cooked and visually appealing.", "This style suits a fine-dining context."],
          "imageSrc": "https://placehold.co/400x300/EEEEEE/000000?text=Deconstructed+Edikang",
          "techniqueType": "modern"
        }
      ],
      "relatedDishes": ["afang-soup", "efo-riro", "vegetable-soup"],
      "imageSrc": "https://placehold.co/600x400/CCCCCC/000000?text=Edikang+Ikong"
    },
    {
      "id": "pepper-soup-goat",
      "name": "Goat Meat Pepper Soup",
      "category": "nigerian",
      "subcategory": "soup",
      "description": "A light, intensely flavored, and spicy broth soup made with goat meat and a blend of traditional aromatic spices. It's known for its medicinal and warming properties.",
      "origin": "Nigeria (widely popular)",
      "ingredients": ["Goat meat", "Pepper soup spice mix (e.g., ehuru, uda, uziza seeds, ataiko)", "Scotch bonnet peppers or chili powder", "Onions", "Garlic", "Ginger", "Scent leaves (efirin/nchanwu)", "Salt", "Seasoning cubes"],
      "platingTechniques": [
        {
          "id": "peppersoup-rustic-mug",
          "name": "Rustic Mug Comfort",
          "description": "Serving pepper soup in a rustic mug or deep bowl to emphasize its comforting and aromatic nature.",
          "steps": ["Ladle the hot pepper soup into a large, deep mug or a rustic earthenware bowl.", "Ensure plenty of goat meat pieces are included.", "Garnish generously with freshly chopped scent leaves or uziza leaves.", "Serve with a side of boiled yam, plantain, or agidi/eko if desired."],
          "tips": ["The aroma is a key part of the experience, so serve piping hot.", "A generous garnish of fresh herbs enhances both flavor and visual appeal.", "A simple, unpretentious presentation works best."],
          "imageSrc": "https://placehold.co/400x300/EEEEEE/000000?text=Rustic+Pepper+Soup",
          "techniqueType": "comfort"
        },
        {
          "id": "peppersoup-clear-focus",
          "name": "Clear Broth Focus",
          "description": "A refined presentation in a clear bowl or wide dish that highlights the clarity of the broth and the quality of the ingredients.",
          "steps": ["Use a clear glass bowl or a wide, shallow white bowl.", "Carefully pour the pepper soup, ensuring the broth remains clear.", "Arrange the goat meat pieces attractively.", "Float a few whole spices or fresh pepper slices for visual interest.", "Garnish with a single, perfect sprig of scent leaf."],
          "tips": ["Strain the broth if necessary for extra clarity.", "Focus on high-quality, visually appealing pieces of meat.", "Minimalist presentation allows the soup to shine."],
          "imageSrc": "https://placehold.co/400x300/EEEEEE/000000?text=Clear+Pepper+Soup",
          "techniqueType": "refined"
        }
      ],
      "relatedDishes": ["fish-pepper-soup", "chicken-pepper-soup", "nsala-soup"],
      "imageSrc": "https://placehold.co/600x400/CCCCCC/000000?text=Goat+Pepper+Soup"
    }
]
}